app/controllers/candidatos_controller.rb

  def create
    @candidato = Candidato.new(candidato_params)

    respond_to do |format|
      if @candidato.save
---
INSERT INTO "candidatos" ("CPF", "Nome", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["CPF", "821738971"], ["Nome", "edu"], ["created_at", "2019-09-19 02:42:20.327733"], ["updated_at", "2019-09-19 02:42:20.327733"]]

  def destroy
    @candidato.destroy
---
DELETE FROM "candidatos" WHERE "candidatos"."id" = $1  [["id", 5]]

    def set_candidato
      @candidato = Candidato.find(params[:id])
---
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]